#include <iostream>
#include <set>
#include <map>
#include <vector>
#include <string>
#include <iostream>
#include <iomanip>


using namespace std;

struct EveryPerson {
    string name;
    multiset<int> dates;
    vector<int> jobTime;
};


vector<string> split(string s, char c) {
    vector<string> splittedstring;
    string tempString;
    for (int i = 0; i <= s.size(); ++i) {
        if (s[i] != c && i != s.size() && s[i] != '\n') {
            tempString += s[i];
        } else {
            splittedstring.push_back(tempString);
            tempString = "";
            continue;
        }
    }
    return splittedstring;
}

vector<string> splitForWord(string s, string w) {

    //s.replace(s.begin(), s.end(), "\r", "\t");
    //s.replace(s.begin(), s.end(), "\n", "\t");
    vector<string> splittedString;
    vector<string> tempVector = split(s, '\n');
    string tempString;
    for (int i = 0; i < tempVector.size(); ++i) {
        if (tempVector[i].length() == 0) {
            continue;
        }
        if (tempVector[i].substr(1, tempVector[i].size()) != w &&
            i != tempVector.size() - 1) { //      fix it to ->      stricmp(tempVector[i], w) != 0
            tempString += tempVector[i];
            tempString += '\n';
        } else {
            splittedString.push_back(tempString);
            //splittedString.push_back("\n");
            tempString = "";
            continue;
        }
    }

    return splittedString;
}


int toMinutten(string &s) {
    int h = stoi(split(s, ':')[0]);
    int min = stoi(split(s, ':')[1]);
    return h * 60 + min;
}

string toNormalHoursAndMinutes(int fullMinutes) {
    string s;
    s += to_string(fullMinutes / 60);
    s += ":";
    s += to_string(fullMinutes % 60);
    return s;
}

pair<string, int> basicStringTokenaser(const string &stt) {
    pair<string, int> today;
    today.first = split(stt, '\t')[2];
    today.second = toMinutten(split(stt, '\t')[split(stt, '\t').size() - 1]);
    return today;
}

void pairPrint(const pair<string, int> &para) {
    cout << para.first << "  " << toNormalHoursAndMinutes(para.second);
}


EveryPerson testperson() {
    EveryPerson person;
    person.name = "name surname lastname";    // test Subject del after
    person.dates = {1, 4, 5, 6, 7, 8, 9, 10};    // test Subject del after
    person.jobTime = {3, 5, 4, 6, 8, 7, 5, 10};   // test Subject del after

    return person;
}


string getName(string s) {
    //george implimentation

}

string toTable(EveryPerson e) {               //fix it
    string outPut;
    outPut += e.name;
   // outPut += '\n';
   // outPut += '\t';
    outPut += '|';
    int measure = outPut.length();
    for (int i = 0; i < 27; ++i) {
        if (e.dates.find(i) != e.dates.end()) {
            outPut += '  ';
            outPut += to_string(i);
            outPut += '  ';
            outPut += '|';
        } else {
            outPut += '  ';
            outPut += '  ';
            outPut += '|';

        }
    }
    outPut += "\n";
    for (int j = 0; j < measure; ++j) {
        outPut += " ";
    }
    for (int i = 0; i < 27; ++i) {
        if (e.dates.find(i) != e.dates.end()) {
            outPut += '  ';
            outPut += to_string( e.jobTime[i]);
            outPut += '  ';
            outPut += '|';
        } else {
            outPut += '  ';
            outPut += '  ';
            outPut += '|';

        }
    }

    //george implimentation

    return outPut;
}


string teststring() {

    string tStr = "\tБезлюдная Инна Семеновна\tНомер\t151/31630sss\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t09:24\tВыход\t01.08.2019\t17:05\t7:41\n"
                  "\tВход\t02.08.2019\t09:01\tВыход\t02.08.2019\t11:06\t2:05\n"
                  "\tВход\t02.08.2019\t11:20\tВыход\t02.08.2019\t16:35\t5:15\n"
                  "\tВход\t05.08.2019\t09:06\tВыход\t05.08.2019\t17:27\t8:20\n"
                  "\tВход\t06.08.2019\t11:05\tВыход\t06.08.2019\t13:17\t2:11\n"
                  "\tВход\t06.08.2019\t13:21\tВыход\t06.08.2019\t13:22\t0:01\n"
                  "\tВход\t06.08.2019\t13:25\tВыход\t06.08.2019\t16:26\t3:00\n"
                  "\tВход\t07.08.2019\t10:05\tВыход\t07.08.2019\t11:22\t1:16\n"
                  "\tВход\t07.08.2019\t11:35\tВыход\t07.08.2019\t17:02\t5:27\n"
                  "\tВход\t12.08.2019\t08:57\tВыход\t12.08.2019\t11:28\t2:30\n"
                  "\tВход\t12.08.2019\t11:41\tВыход\t12.08.2019\t16:54\t5:13\n"
                  "\tВход\t13.08.2019\t09:28\tВыход\t13.08.2019\t11:20\t1:52\n"
                  "\tВход\t13.08.2019\t11:35\tВыход\t13.08.2019\t16:54\t5:19\n"
                  "\tВход\t14.08.2019\t09:37\tВыход\t14.08.2019\t11:20\t1:42\n"
                  "\tВход\t14.08.2019\t12:28\tВыход\t14.08.2019\t17:08\t4:40\n"
                  "\tВход\t15.08.2019\t10:06\tВыход\t15.08.2019\t17:08\t7:02\n"
                  "\tВход\t16.08.2019\t09:40\tВыход\t16.08.2019\t11:14\t1:34\n"
                  "\tВход\t16.08.2019\t11:29\tВыход\t16.08.2019\t17:07\t5:38\n"
                  "\tВход\t19.08.2019\t09:20\tВыход\t19.08.2019\t11:10\t1:50\n"
                  "\tВход\t19.08.2019\t11:26\tВыход\t19.08.2019\t13:36\t2:10\n"
                  "\tВход\t20.08.2019\t09:10\tВыход\t20.08.2019\t11:14\t2:04\n"
                  "\tВход\t20.08.2019\t11:27\tВыход\t20.08.2019\t15:51\t4:23\n"
                  "\tВход\t21.08.2019\t09:41\tВыход\t21.08.2019\t11:26\t1:45\n"
                  "\tВход\t21.08.2019\t13:25\tВыход\t21.08.2019\t18:13\t4:48\n"
                  "\tВход\t22.08.2019\t10:09\tВыход\t22.08.2019\t11:25\t1:16\n"
                  "\tВход\t22.08.2019\t11:43\tВыход\t22.08.2019\t16:15\t4:32\n"
                  "\tВход\t23.08.2019\t09:48\tВыход\t23.08.2019\t11:46\t1:57\n"
                  "\tВход\t23.08.2019\t11:58\tВыход\t23.08.2019\t17:10\t5:11\n"
                  "\tВсего\t100:48\n"
                  "\tвремени:\n"
                  "\n"
                  "\tБезлюдный Вячеслав Викторович\tНомер\t151/36461\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\n"
                  "\tВсего\t0:00\n"
                  "\tвремени:\n"
                  "\n"
                  "\tБожедомов Вячеслав Георгиевич\tНомер\t151/31470\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\n"
                  "\tВсего\t0:00\n"
                  "\tвремени:\n"
                  "\n"
                  "\tБожедомов Георгий Вячеславович\tНомер\t122/02758\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t08:54\tВыход\t01.08.2019\t09:01\t0:07\n"
                  "\tВход\t01.08.2019\t09:05\tВыход\t01.08.2019\t12:05\t2:59\n"
                  "\tВход\t01.08.2019\t12:10\tВыход\t01.08.2019\t17:03\t4:52\n"
                  "\tВход\t02.08.2019\t08:57\tВыход\t02.08.2019\t10:40\t1:43\n"
                  "\tВыход\t02.08.2019\t16:52\n"
                  "\tВход\t05.08.2019\t09:21\tВыход\t05.08.2019\t13:45\t4:24\n"
                  "\tВход\t12.08.2019\t08:39\n"
                  "\tВход\t13.08.2019\t08:47\tВыход\t13.08.2019\t14:45\t5:57\n"
                  "\tВход\t14.08.2019\t10:05\tВыход\t14.08.2019\t10:13\t0:07\n"
                  "\tВход\t14.08.2019\t10:18\tВыход\t14.08.2019\t17:20\t7:02\n"
                  "\tВход\t16.08.2019\t09:09\tВыход\t16.08.2019\t12:05\t2:56\n"
                  "\tВход\t16.08.2019\t12:42\tВыход\t16.08.2019\t13:56\t1:14\n"
                  "\tВход\t19.08.2019\t08:58\tВыход\t19.08.2019\t17:00\t8:01\n"
                  "\tВход\t21.08.2019\t08:36\tВыход\t21.08.2019\t11:45\t3:09\n"
                  "\tВход\t21.08.2019\t12:26\tВыход\t21.08.2019\t17:02\t4:36\n"
                  "\tВход\t22.08.2019\t08:55\tВыход\t22.08.2019\t12:01\t3:06\n"
                  "\tВход\t23.08.2019\t09:02\tВыход\t23.08.2019\t17:10\t8:08\n"
                  "\tВход\t26.08.2019\t11:31\tВыход\t26.08.2019\t17:00\t5:29\n"
                  "\tВход\t27.08.2019\t08:42\n"
                  "\tВход\t28.08.2019\t10:31\tВыход\t28.08.2019\t11:59\t1:28\n"
                  "\tВход\t28.08.2019\t12:24\tВыход\t28.08.2019\t17:07\t4:43\n"
                  "\tВход\t29.08.2019\t09:21\tВыход\t29.08.2019\t11:50\t2:28\n"
                  "\tВход\t29.08.2019\t11:56\tВыход\t29.08.2019\t15:49\t3:53\n"
                  "\tВсего\t76:27\n"
                  "\tвремени:\n"
                  "\n"
                  "\tВаганян Людмила Грантовна\tНомер\t151/42473\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t07:41\tВыход\t01.08.2019\t10:25\t2:44\n"
                  "\tВход\t06.08.2019\t07:41\tВыход\t06.08.2019\t10:16\t2:34\n"
                  "\tВход\t07.08.2019\t07:43\tВыход\t07.08.2019\t09:39\t1:55\n"
                  "\tВход\t08.08.2019\t07:42\tВыход\t08.08.2019\t10:13\t2:31\n"
                  "\tВход\t13.08.2019\t07:47\tВыход\t13.08.2019\t10:32\t2:45\n"
                  "\tВыход\t13.08.2019\t10:33\n"
                  "\tВход\t15.08.2019\t07:41\tВыход\t15.08.2019\t10:06\t2:25\n"
                  "\tВход\t20.08.2019\t07:42\tВыход\t20.08.2019\t10:14\t2:32\n"
                  "\tВход\t22.08.2019\t07:49\tВыход\t22.08.2019\t10:06\t2:17\n"
                  "\tВыход\t22.08.2019\t10:06\n"
                  "\tВход\t27.08.2019\t07:45\tВыход\t27.08.2019\t10:17\t2:32\n"
                  "\tВход\t28.08.2019\t07:50\tВыход\t28.08.2019\t09:19\t1:29\n"
                  "\tВход\t29.08.2019\t07:42\tВыход\t29.08.2019\t09:51\t2:09\n"
                  "\tВсего\t25:55\n"
                  "\tвремени:\n"
                  "\n"
                  "\tГришина Елена Александровна\tНомер\t173/50984\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t07:56\tВыход\t01.08.2019\t17:03\t9:07\n"
                  "\tВход\t02.08.2019\t08:01\tВыход\t02.08.2019\t16:58\t8:57\n"
                  "\tВход\t05.08.2019\t08:01\tВыход\t05.08.2019\t17:02\t9:00\n"
                  "\tВход\t06.08.2019\t07:46\tВыход\t06.08.2019\t17:05\t9:19\n"
                  "\tВход\t07.08.2019\t07:49\tВыход\t07.08.2019\t17:04\t9:14\n"
                  "\tВход\t08.08.2019\t07:49\tВыход\t08.08.2019\t17:10\t9:20\n"
                  "\tВход\t09.08.2019\t07:52\tВыход\t09.08.2019\t15:46\t7:54\n"
                  "\tВход\t12.08.2019\t07:48\tВыход\t12.08.2019\t17:07\t9:19\n"
                  "\tВход\t13.08.2019\t07:49\tВыход\t13.08.2019\t17:03\t9:13\n"
                  "\tВход\t14.08.2019\t07:54\tВыход\t14.08.2019\t17:15\t9:21\n"
                  "\tВход\t15.08.2019\t07:42\tВыход\t15.08.2019\t17:06\t9:24\n"
                  "\tВход\t16.08.2019\t08:10\tВыход\t16.08.2019\t17:13\t9:03\n"
                  "\tВход\t19.08.2019\t07:53\tВыход\t19.08.2019\t16:54\t9:00\n"
                  "\tВход\t20.08.2019\t07:54\tВыход\t20.08.2019\t17:06\t9:11\n"
                  "\tВход\t21.08.2019\t08:01\tВыход\t21.08.2019\t17:01\t9:00\n"
                  "\tВход\t22.08.2019\t07:46\tВыход\t22.08.2019\t17:00\t9:14\n"
                  "\tВход\t23.08.2019\t08:24\tВыход\t23.08.2019\t17:03\t8:39\n"
                  "\tВход\t26.08.2019\t07:47\tВыход\t26.08.2019\t16:56\t9:08\n"
                  "\tВход\t27.08.2019\t07:41\tВыход\t27.08.2019\t17:03\t9:21\n"
                  "\tВход\t28.08.2019\t07:54\tВыход\t28.08.2019\t17:01\t9:06\n"
                  "\tВход\t29.08.2019\t07:45\tВыход\t29.08.2019\t17:15\t9:29\n"
                  "\tВход\t30.08.2019\t07:49\tВыход\t30.08.2019\t15:06\t7:17\n"
                  "\tВсего\t198:44\n"
                  "\tвремени:\n"
                  "\n"
                  "\tДемичев Сергей Эдуардович\tНомер\t151/37729\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t07:24\tВыход\t01.08.2019\t12:06\t4:42\n"
                  "\tВход\t05.08.2019\t07:10\tВыход\t05.08.2019\t12:24\t5:14\n"
                  "\tВход\t09.08.2019\t07:10\tВыход\t09.08.2019\t12:18\t5:08\n"
                  "\tВход\t12.08.2019\t07:07\tВыход\t12.08.2019\t12:57\t5:50\n"
                  "\tВход\t13.08.2019\t07:08\tВыход\t13.08.2019\t12:46\t5:37\n"
                  "\tВход\t16.08.2019\t07:11\tВыход\t16.08.2019\t11:52\t4:41\n"
                  "\tВход\t20.08.2019\t07:10\tВыход\t20.08.2019\t12:31\t5:20\n"
                  "\tВход\t21.08.2019\t08:33\tВыход\t21.08.2019\t11:49\t3:16\n"
                  "\tВход\t23.08.2019\t11:32\tВыход\t23.08.2019\t12:27\t0:55\n"
                  "\tВход\t27.08.2019\t11:29\tВыход\t27.08.2019\t15:19\t3:49\n"
                  "\tВход\t28.08.2019\t06:48\tВыход\t28.08.2019\t12:00\t5:12\n"
                  "\tВход\t29.08.2019\t06:56\tВыход\t29.08.2019\t12:34\t5:37\n"
                  "\tВсего\t55:24\n"
                  "\tвремени:\n"
                  "\n"
                  "\tЕжов Андрей Геннадиевич\tНомер\t151/44620\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t19.08.2019\t08:07\tВыход\t19.08.2019\t09:43\t1:36\n"
                  "\tВход\t20.08.2019\t08:14\tВыход\t20.08.2019\t17:09\t8:54\n"
                  "\tВход\t21.08.2019\t08:24\tВыход\t21.08.2019\t17:01\t8:37\n"
                  "\tВход\t22.08.2019\t08:12\tВыход\t22.08.2019\t17:06\t8:53\n"
                  "\tВход\t23.08.2019\t08:26\tВыход\t23.08.2019\t17:09\t8:42\n"
                  "\tВход\t26.08.2019\t08:11\tВыход\t26.08.2019\t17:05\t8:54\n"
                  "\tВход\t27.08.2019\t08:22\tВыход\t27.08.2019\t17:03\t8:41\n"
                  "\tВход\t28.08.2019\t08:21\tВыход\t28.08.2019\t17:59\t9:38\n"
                  "\tВход\t29.08.2019\t08:29\tВыход\t29.08.2019\t17:01\t8:32\n"
                  "\tВход\t30.08.2019\t08:27\tВыход\t30.08.2019\t15:07\t6:39\n"
                  "\tВсего\t79:10\n"
                  "\tвремени:\n"
                  "\n"
                  "\tЕлкин Сергей Валериевич\tНомер\t143/05599\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t08:06\tВыход\t01.08.2019\t16:52\t8:46\n"
                  "\tВход\t02.08.2019\t08:26\tВыход\t02.08.2019\t17:17\t8:51\n"
                  "\tВход\t05.08.2019\t08:30\tВыход\t05.08.2019\t17:21\t8:51\n"
                  "\tВход\t06.08.2019\t08:25\n"
                  "\tВход\t06.08.2019\t13:11\tВыход\t06.08.2019\t17:02\t3:51\n"
                  "\tВход\t07.08.2019\t08:10\tВыход\t07.08.2019\t17:16\t9:06\n"
                  "\tВход\t08.08.2019\t08:09\tВыход\t08.08.2019\t19:31\t11:22\n"
                  "\tВход\t09.08.2019\t08:13\tВыход\t09.08.2019\t16:54\t8:41\n"
                  "\tВход\t10.08.2019\t10:36\tВыход\t10.08.2019\t16:32\t5:56\n"
                  "\tВход\t12.08.2019\t08:19\tВыход\t12.08.2019\t12:10\t3:51\n"
                  "\tВход\t12.08.2019\t12:11\tВыход\t12.08.2019\t17:33\t5:22\n"
                  "\tВход\t13.08.2019\t08:08\n"
                  "\tВход\t13.08.2019\t08:08\tВыход\t13.08.2019\t17:16\t9:07\n"
                  "\tВход\t14.08.2019\t08:21\tВыход\t14.08.2019\t18:52\t10:30\n"
                  "\tВход\t15.08.2019\t08:30\tВыход\t15.08.2019\t11:01\t2:31\n"
                  "\tВход\t15.08.2019\t11:03\tВыход\t15.08.2019\t17:41\t6:38\n"
                  "\tВход\t16.08.2019\t08:46\tВыход\t16.08.2019\t10:48\t2:02\n"
                  "\tВход\t16.08.2019\t10:49\tВыход\t16.08.2019\t12:05\t1:16\n"
                  "\tВход\t16.08.2019\t12:42\tВыход\t16.08.2019\t19:27\t6:45\n"
                  "\tВход\t19.08.2019\t08:20\tВыход\t19.08.2019\t17:17\t8:56\n"
                  "\tВход\t20.08.2019\t08:07\tВыход\t20.08.2019\t11:47\t3:39\n"
                  "\tВход\t20.08.2019\t12:16\tВыход\t20.08.2019\t17:53\t5:37\n"
                  "\tВход\t21.08.2019\t08:30\tВыход\t21.08.2019\t17:08\t8:38\n"
                  "\tВход\t21.08.2019\t17:12\tВыход\t21.08.2019\t17:17\t0:05\n"
                  "\tВход\t22.08.2019\t08:19\n"
                  "\tВход\t22.08.2019\t08:19\tВыход\t22.08.2019\t09:53\t1:34\n"
                  "\tВход\t26.08.2019\t08:39\tВыход\t26.08.2019\t18:05\t9:25\n"
                  "\tВход\t27.08.2019\t08:26\tВыход\t27.08.2019\t17:05\t8:39\n"
                  "\tВход\t28.08.2019\t08:21\tВыход\t28.08.2019\t13:20\t4:59\n"
                  "\tВыход\t28.08.2019\t13:20\n"
                  "\tВход\t28.08.2019\t13:40\tВыход\t28.08.2019\t17:42\t4:02\n"
                  "\tВход\t29.08.2019\t08:16\tВыход\t29.08.2019\t17:01\t8:45\n"
                  "\tВход\t30.08.2019\t08:08\tВыход\t30.08.2019\t08:14\t0:06\n"
                  "\tВход\t30.08.2019\t08:15\tВыход\t30.08.2019\t11:46\t3:31\n"
                  "\tВход\t30.08.2019\t12:14\n"
                  "\tВход\t30.08.2019\t12:14\tВыход\t30.08.2019\t15:30\t3:16\n"
                  "\tВсего\t184:44\n"
                  "\tвремени:\n"
                  "\n"
                  "\tЗайцева Лилия Николаевна\tНомер\t173/48848\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t08:45\tВыход\t01.08.2019\t17:03\t8:18\n"
                  "\tВход\t02.08.2019\t11:09\tВыход\t02.08.2019\t16:57\t5:48\n"
                  "\tВход\t05.08.2019\t08:35\tВыход\t05.08.2019\t17:02\t8:26\n"
                  "\tВход\t06.08.2019\t08:59\tВыход\t06.08.2019\t17:06\t8:07\n"
                  "\tВход\t07.08.2019\t09:09\tВыход\t07.08.2019\t17:04\t7:55\n"
                  "\tВход\t08.08.2019\t08:46\tВыход\t08.08.2019\t17:10\t8:24\n"
                  "\tВход\t09.08.2019\t11:22\tВыход\t09.08.2019\t15:46\t4:24\n"
                  "\tВход\t12.08.2019\t09:01\tВыход\t12.08.2019\t17:05\t8:04\n"
                  "\tВход\t13.08.2019\t08:50\tВыход\t13.08.2019\t17:03\t8:12\n"
                  "\tВход\t14.08.2019\t09:05\tВыход\t14.08.2019\t17:09\t8:04\n"
                  "\tВход\t15.08.2019\t08:42\tВыход\t15.08.2019\t17:06\t8:24\n"
                  "\tВход\t16.08.2019\t09:58\tВыход\t16.08.2019\t12:30\t2:32\n"
                  "\tВход\t19.08.2019\t08:41\tВыход\t19.08.2019\t16:54\t8:12\n"
                  "\tВход\t20.08.2019\t08:46\tВыход\t20.08.2019\t17:25\t8:38\n"
                  "\tВход\t21.08.2019\t09:20\tВыход\t21.08.2019\t16:47\t7:27\n"
                  "\tВход\t22.08.2019\t09:51\tВыход\t22.08.2019\t17:07\t7:16\n"
                  "\tВход\t26.08.2019\t08:49\tВыход\t26.08.2019\t16:59\t8:10\n"
                  "\tВход\t27.08.2019\t08:47\tВыход\t27.08.2019\t17:03\t8:15\n"
                  "\tВход\t28.08.2019\t08:48\tВыход\t28.08.2019\t17:04\t8:16\n"
                  "\tВход\t29.08.2019\t09:56\tВыход\t29.08.2019\t17:16\t7:20\n"
                  "\tВход\t30.08.2019\t09:21\tВыход\t30.08.2019\t14:46\t5:24\n"
                  "\tВсего\t155:42\n"
                  "\tвремени:\n"
                  "\n"
                  "\tКлейнов Сергей Семенович\tНомер\t151/33829\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t06:29\tВыход\t01.08.2019\t09:12\t2:43\n"
                  "\tВход\t01.08.2019\t09:13\tВыход\t01.08.2019\t11:19\t2:05\n"
                  "\tВход\t01.08.2019\t11:24\tВыход\t01.08.2019\t16:56\t5:32\n"
                  "\tВход\t02.08.2019\t06:34\tВыход\t02.08.2019\t09:30\t2:56\n"
                  "\tВход\t02.08.2019\t09:33\tВыход\t02.08.2019\t11:32\t1:59\n"
                  "\tВход\t02.08.2019\t11:52\tВыход\t02.08.2019\t16:40\t4:48\n"
                  "\tВход\t05.08.2019\t06:31\tВыход\t05.08.2019\t17:04\t10:33\n"
                  "\tВход\t06.08.2019\t06:43\tВыход\t06.08.2019\t10:00\t3:16\n"
                  "\tВход\t06.08.2019\t10:02\tВыход\t06.08.2019\t16:29\t6:27\n"
                  "\tВход\t07.08.2019\t06:29\tВыход\t07.08.2019\t17:06\t10:36\n"
                  "\tВход\t08.08.2019\t06:33\tВыход\t08.08.2019\t09:48\t3:15\n"
                  "\tВход\t08.08.2019\t09:51\tВыход\t08.08.2019\t15:23\t5:32\n"
                  "\tВход\t08.08.2019\t15:30\tВыход\t08.08.2019\t16:53\t1:23\n"
                  "\tВход\t09.08.2019\t06:29\tВыход\t09.08.2019\t09:48\t3:19\n"
                  "\tВход\t09.08.2019\t09:50\tВыход\t09.08.2019\t09:52\t0:01\n"
                  "\tВход\t09.08.2019\t09:56\tВыход\t09.08.2019\t15:48\t5:51\n"
                  "\tВход\t09.08.2019\t16:00\tВыход\t09.08.2019\t16:49\t0:49\n"
                  "\tВход\t12.08.2019\t06:26\tВыход\t12.08.2019\t12:33\t6:07\n"
                  "\tВход\t12.08.2019\t12:47\tВыход\t12.08.2019\t13:44\t0:57\n"
                  "\tВход\t12.08.2019\t13:48\tВыход\t12.08.2019\t16:51\t3:02\n"
                  "\tВход\t13.08.2019\t06:14\tВыход\t13.08.2019\t09:12\t2:57\n"
                  "\tВход\t13.08.2019\t09:14\tВыход\t13.08.2019\t16:50\t7:36\n"
                  "\tВход\t13.08.2019\t16:55\tВыход\t13.08.2019\t16:59\t0:04\n"
                  "\tВход\t14.08.2019\t06:29\tВыход\t14.08.2019\t10:16\t3:47\n"
                  "\tВход\t14.08.2019\t10:27\tВыход\t14.08.2019\t11:19\t0:52\n"
                  "\tВход\t14.08.2019\t11:21\tВыход\t14.08.2019\t16:53\t5:32\n"
                  "\tВход\t15.08.2019\t06:27\tВыход\t15.08.2019\t11:31\t5:03\n"
                  "\tВход\t15.08.2019\t11:50\tВыход\t15.08.2019\t17:10\t5:20\n"
                  "\tВход\t16.08.2019\t06:24\tВыход\t16.08.2019\t09:21\t2:57\n"
                  "\tВход\t16.08.2019\t09:23\tВыход\t16.08.2019\t11:34\t2:11\n"
                  "\tВход\t16.08.2019\t11:55\tВыход\t16.08.2019\t16:51\t4:56\n"
                  "\tВход\t19.08.2019\t06:32\tВыход\t19.08.2019\t09:11\t2:39\n"
                  "\tВход\t19.08.2019\t09:38\tВыход\t19.08.2019\t13:02\t3:23\n"
                  "\tВыход\t19.08.2019\t13:02\n"
                  "\tВход\t19.08.2019\t13:02\tВыход\t19.08.2019\t16:54\t3:52\n"
                  "\tВход\t20.08.2019\t06:26\tВыход\t20.08.2019\t10:32\t4:06\n"
                  "\tВход\t20.08.2019\t10:34\n"
                  "\tВход\t20.08.2019\t13:55\tВыход\t20.08.2019\t13:56\t0:01\n"
                  "\tВход\t20.08.2019\t14:13\tВыход\t20.08.2019\t17:23\t3:09\n"
                  "\tВход\t21.08.2019\t06:40\tВыход\t21.08.2019\t16:48\t10:08\n"
                  "\tВход\t22.08.2019\t09:53\tВыход\t22.08.2019\t09:55\t0:02\n"
                  "\tВход\t22.08.2019\t09:56\tВыход\t22.08.2019\t16:15\t6:18\n"
                  "\tВход\t23.08.2019\t06:44\tВыход\t23.08.2019\t08:48\t2:04\n"
                  "\tВход\t23.08.2019\t09:04\tВыход\t23.08.2019\t12:53\t3:49\n"
                  "\tВход\t26.08.2019\t07:33\tВыход\t26.08.2019\t09:26\t1:52\n"
                  "\tВход\t26.08.2019\t09:29\tВыход\t26.08.2019\t17:06\t7:36\n"
                  "\tВход\t27.08.2019\t07:07\tВыход\t27.08.2019\t09:57\t2:50\n"
                  "\tВход\t27.08.2019\t09:58\tВыход\t27.08.2019\t11:42\t1:44\n"
                  "\tВход\t27.08.2019\t11:44\tВыход\t27.08.2019\t16:52\t5:08\n"
                  "\tВход\t28.08.2019\t06:26\tВыход\t28.08.2019\t16:32\t10:05\n"
                  "\tВход\t29.08.2019\t06:43\tВыход\t29.08.2019\t09:32\t2:48\n"
                  "\tВход\t29.08.2019\t09:34\tВыход\t29.08.2019\t16:57\t7:23\n"
                  "\tВход\t30.08.2019\t07:42\tВыход\t30.08.2019\t09:40\t1:58\n"
                  "\tВход\t30.08.2019\t09:42\tВыход\t30.08.2019\t13:48\t4:06\n"
                  "\tВсего\t207:41\n"
                  "\tвремени:\n"
                  "\n"
                  "\tКурышев Константин Александрович\tНомер\t151/34953\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t02.08.2019\t09:17\tВыход\t02.08.2019\t12:37\t3:20\n"
                  "\tВход\t13.08.2019\t10:48\tВыход\t13.08.2019\t13:46\t2:57\n"
                  "\tВход\t14.08.2019\t10:12\tВыход\t14.08.2019\t15:42\t5:30\n"
                  "\tВход\t23.08.2019\t09:57\tВыход\t23.08.2019\t12:51\t2:53\n"
                  "\tВсего\t14:41\n"
                  "\tвремени:\n"
                  "\n"
                  "\tНагаев Владимир Дмитриевич\tНомер\t142/60269\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t11:53\tВыход\t01.08.2019\t12:36\t0:42\n"
                  "\tВход\t01.08.2019\t12:48\tВыход\t01.08.2019\t16:52\t4:04\n"
                  "\tВход\t02.08.2019\t11:15\tВыход\t02.08.2019\t15:33\t4:18\n"
                  "\tВход\t05.08.2019\t11:18\tВыход\t05.08.2019\t12:18\t1:00\n"
                  "\tВход\t05.08.2019\t12:24\tВыход\t05.08.2019\t16:06\t3:42\n"
                  "\tВход\t06.08.2019\t08:43\tВыход\t06.08.2019\t12:25\t3:42\n"
                  "\tВход\t06.08.2019\t12:39\tВыход\t06.08.2019\t12:47\t0:08\n"
                  "\tВход\t06.08.2019\t13:16\tВыход\t06.08.2019\t13:34\t0:17\n"
                  "\tВход\t06.08.2019\t13:37\tВыход\t06.08.2019\t13:43\t0:06\n"
                  "\tВход\t06.08.2019\t14:35\tВыход\t06.08.2019\t16:56\t2:20\n"
                  "\tВход\t07.08.2019\t08:45\tВыход\t07.08.2019\t12:09\t3:24\n"
                  "\tВход\t07.08.2019\t12:45\tВыход\t07.08.2019\t17:16\t4:31\n"
                  "\tВход\t08.08.2019\t08:34\tВыход\t08.08.2019\t11:57\t3:23\n"
                  "\tВход\t08.08.2019\t13:08\tВыход\t08.08.2019\t16:52\t3:43\n"
                  "\tВход\t09.08.2019\t08:30\tВыход\t09.08.2019\t10:20\t1:49\n"
                  "\tВход\t09.08.2019\t12:56\tВыход\t09.08.2019\t16:54\t3:57\n"
                  "\tВход\t12.08.2019\t08:34\tВыход\t12.08.2019\t12:28\t3:54\n"
                  "\tВход\t12.08.2019\t13:05\tВыход\t12.08.2019\t17:01\t3:56\n"
                  "\tВход\t13.08.2019\t08:36\tВыход\t13.08.2019\t15:48\t7:11\n"
                  "\tВход\t14.08.2019\t08:41\tВыход\t14.08.2019\t12:08\t3:27\n"
                  "\tВход\t14.08.2019\t12:21\tВыход\t14.08.2019\t12:24\t0:02\n"
                  "\tВход\t14.08.2019\t12:34\tВыход\t14.08.2019\t17:01\t4:27\n"
                  "\tВход\t15.08.2019\t08:38\tВыход\t15.08.2019\t12:25\t3:47\n"
                  "\tВход\t15.08.2019\t13:15\tВыход\t15.08.2019\t17:10\t3:55\n"
                  "\tВход\t16.08.2019\t08:49\tВыход\t16.08.2019\t12:05\t3:16\n"
                  "\tВход\t16.08.2019\t12:42\tВыход\t16.08.2019\t17:13\t4:31\n"
                  "\tВход\t19.08.2019\t08:20\tВыход\t19.08.2019\t11:58\t3:37\n"
                  "\tВход\t19.08.2019\t12:54\tВыход\t19.08.2019\t17:09\t4:15\n"
                  "\tВход\t20.08.2019\t08:34\tВыход\t20.08.2019\t10:45\t2:11\n"
                  "\tВход\t20.08.2019\t10:51\tВыход\t20.08.2019\t11:47\t0:55\n"
                  "\tВход\t20.08.2019\t12:16\tВыход\t20.08.2019\t17:10\t4:54\n"
                  "\tВход\t21.08.2019\t08:39\tВыход\t21.08.2019\t11:45\t3:06\n"
                  "\tВход\t21.08.2019\t12:26\tВыход\t21.08.2019\t17:02\t4:36\n"
                  "\tВход\t22.08.2019\t08:36\tВыход\t22.08.2019\t12:28\t3:52\n"
                  "\tВход\t22.08.2019\t12:33\tВыход\t22.08.2019\t14:13\t1:40\n"
                  "\tВход\t23.08.2019\t08:30\tВыход\t23.08.2019\t08:34\t0:03\n"
                  "\tВход\t23.08.2019\t08:39\tВыход\t23.08.2019\t12:13\t3:33\n"
                  "\tВход\t23.08.2019\t12:55\tВыход\t23.08.2019\t17:07\t4:12\n"
                  "\tВход\t26.08.2019\t08:42\tВыход\t26.08.2019\t11:52\t3:10\n"
                  "\tВход\t26.08.2019\t12:12\tВыход\t26.08.2019\t16:59\t4:47\n"
                  "\tВход\t27.08.2019\t08:36\tВыход\t27.08.2019\t11:55\t3:19\n"
                  "\tВход\t27.08.2019\t12:38\tВыход\t27.08.2019\t17:05\t4:26\n"
                  "\tВход\t28.08.2019\t08:55\tВыход\t28.08.2019\t10:13\t1:18\n"
                  "\tВход\t28.08.2019\t10:15\tВыход\t28.08.2019\t11:59\t1:44\n"
                  "\tВход\t28.08.2019\t12:24\tВыход\t28.08.2019\t17:59\t5:35\n"
                  "\tВход\t29.08.2019\t08:41\tВыход\t29.08.2019\t11:47\t3:06\n"
                  "\tВход\t29.08.2019\t12:12\tВыход\t29.08.2019\t17:01\t4:48\n"
                  "\tВход\t30.08.2019\t08:51\tВыход\t30.08.2019\t11:46\t2:54\n"
                  "\tВход\t30.08.2019\t12:14\tВыход\t30.08.2019\t15:07\t2:53\n"
                  "\tВсего\t154:41\n"
                  "\tвремени:\n"
                  "\n"
                  "\tНестерёнок Дмитрий Александрович\tНомер\t151/30294\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t02.08.2019\t09:13\tВыход\t02.08.2019\t12:37\t3:24\n"
                  "\tВсего\t3:24\n"
                  "\tвремени:\n"
                  "\n"
                  "\tПолубаринова Галина Владимировна\tНомер\t151/33540\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t08:30\tВыход\t01.08.2019\t17:58\t9:27\n"
                  "\tВход\t02.08.2019\t08:20\tВыход\t02.08.2019\t17:02\t8:41\n"
                  "\tВход\t05.08.2019\t09:04\tВыход\t05.08.2019\t17:08\t8:03\n"
                  "\tВход\t06.08.2019\t08:39\tВыход\t06.08.2019\t20:01\t11:22\n"
                  "\tВход\t07.08.2019\t08:48\tВыход\t07.08.2019\t20:03\t11:15\n"
                  "\tВход\t08.08.2019\t08:22\tВыход\t08.08.2019\t11:57\t3:35\n"
                  "\tВход\t08.08.2019\t12:22\tВыход\t08.08.2019\t19:59\t7:37\n"
                  "\tВход\t09.08.2019\t08:24\tВыход\t09.08.2019\t19:47\t11:23\n"
                  "\tВход\t12.08.2019\t08:27\tВыход\t12.08.2019\t16:38\t8:10\n"
                  "\tВход\t13.08.2019\t08:24\tВыход\t13.08.2019\t20:03\t11:38\n"
                  "\tВход\t14.08.2019\t08:30\tВыход\t14.08.2019\t19:11\t10:41\n"
                  "\tВход\t15.08.2019\t08:24\tВыход\t15.08.2019\t19:00\t10:36\n"
                  "\tВход\t16.08.2019\t08:25\tВыход\t16.08.2019\t12:01\t3:36\n"
                  "\tВход\t16.08.2019\t12:50\tВыход\t16.08.2019\t20:03\t7:13\n"
                  "\tВход\t19.08.2019\t08:15\tВыход\t19.08.2019\t20:00\t11:44\n"
                  "\tВход\t20.08.2019\t08:18\tВыход\t20.08.2019\t19:57\t11:38\n"
                  "\tВход\t21.08.2019\t08:24\tВыход\t21.08.2019\t20:00\t11:36\n"
                  "\tВход\t22.08.2019\t08:28\tВыход\t22.08.2019\t12:02\t3:33\n"
                  "\tВход\t22.08.2019\t12:48\tВыход\t22.08.2019\t20:02\t7:14\n"
                  "\tВход\t23.08.2019\t08:26\tВыход\t23.08.2019\t15:16\t6:49\n"
                  "\tВход\t26.08.2019\t08:35\tВыход\t26.08.2019\t20:00\t11:25\n"
                  "\tВход\t27.08.2019\t08:25\tВыход\t27.08.2019\t20:01\t11:36\n"
                  "\tВход\t28.08.2019\t08:21\tВыход\t28.08.2019\t20:02\t11:41\n"
                  "\tВход\t29.08.2019\t08:41\tВыход\t29.08.2019\t18:32\t9:51\n"
                  "\tВход\t30.08.2019\t08:32\tВыход\t30.08.2019\t20:02\t11:30\n"
                  "\tВсего\t232:03\n"
                  "\tвремени:\n"
                  "\n"
                  "\tПротасов Анатолий Александрович\tНомер\t151/46240\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t02.08.2019\t10:32\tВыход\t02.08.2019\t16:06\t5:34\n"
                  "\tВход\t12.08.2019\t09:53\tВыход\t12.08.2019\t10:26\t0:33\n"
                  "\tВход\t29.08.2019\t08:59\tВыход\t29.08.2019\t17:04\t8:05\n"
                  "\tВход\t30.08.2019\t08:44\tВыход\t30.08.2019\t15:30\t6:45\n"
                  "\tВсего\t20:57\n"
                  "\tвремени:\n"
                  "\n"
                  "\tСагитов Игорь Александрович\tНомер\t151/30722\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t17.08.2019\t10:37\tВыход\t17.08.2019\t13:43\t3:06\n"
                  "\tВход\t17.08.2019\t14:32\tВыход\t17.08.2019\t18:16\t3:44\n"
                  "\tВход\t31.08.2019\t10:48\tВыход\t31.08.2019\t18:33\t7:45\n"
                  "\tВсего\t14:36\n"
                  "\tвремени:\n"
                  "\n"
                  "\tСотникова Ольга Вячеславовна\tНомер\t151/33365\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\n"
                  "\tВсего\t0:00\n"
                  "\tвремени:\n"
                  "\n"
                  "\tФролов Владимир Геннадьевич\tНомер\t151/40749\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\n"
                  "\tВсего\t0:00\n"
                  "\tвремени:\n"
                  "\n"
                  "\tШевцов Александр Александрович\tНомер\t151/41755\n"
                  "\tключа:\n"
                  "\tУстройство входа\tДата\tВремя\tУстройство выхода\tДата\tВремя\tИтого\n"
                  "\n"
                  "\tВход\t01.08.2019\t07:10\tВыход\t01.08.2019\t09:12\t2:02\n"
                  "\tВход\t01.08.2019\t09:13\tВыход\t01.08.2019\t16:56\t7:43\n"
                  "\tВход\t02.08.2019\t07:19\tВыход\t02.08.2019\t10:12\t2:53\n"
                  "\tВход\t02.08.2019\t10:13\tВыход\t02.08.2019\t15:03\t4:50\n"
                  "\tВход\t02.08.2019\t15:04\tВыход\t02.08.2019\t16:58\t1:54\n"
                  "\tВыход\t05.08.2019\t14:02\n"
                  "\tВход\t05.08.2019\t14:03\n"
                  "\tВход\t09.08.2019\t15:38\tВыход\t09.08.2019\t15:44\t0:06\n"
                  "\tВход\t12.08.2019\t07:16\tВыход\t12.08.2019\t17:01\t9:45\n"
                  "\tВход\t13.08.2019\t07:12\tВыход\t13.08.2019\t17:02\t9:50\n"
                  "\tВыход\t13.08.2019\t17:02\n"
                  "\tВход\t14.08.2019\t07:22\tВыход\t14.08.2019\t16:55\t9:33\n"
                  "\tВход\t21.08.2019\t15:04\tВыход\t21.08.2019\t15:13\t0:08\n"
                  "\tВход\t22.08.2019\t07:44\tВыход\t22.08.2019\t09:42\t1:58\n"
                  "\tВход\t22.08.2019\t09:43\tВыход\t22.08.2019\t17:07\t7:24\n"
                  "\tВход\t23.08.2019\t07:47\n"
                  "\tВход\t23.08.2019\t07:47\tВыход\t23.08.2019\t10:12\t2:24\n"
                  "\tВыход\t23.08.2019\t10:12\n"
                  "\tВход\t23.08.2019\t10:14\tВыход\t23.08.2019\t17:05\t6:50\n"
                  "\tВход\t26.08.2019\t07:50\tВыход\t26.08.2019\t09:26\t1:36\n"
                  "\tВход\t26.08.2019\t09:30\tВыход\t26.08.2019\t09:31\t0:01\n"
                  "\tВход\t26.08.2019\t09:31\n"
                  "\tВход\t26.08.2019\t09:31\tВыход\t26.08.2019\t17:02\t7:31\n"
                  "\tВыход\t26.08.2019\t17:02\n"
                  "\tВход\t27.08.2019\t07:34\tВыход\t27.08.2019\t09:58\t2:24\n"
                  "\tВход\t27.08.2019\t09:58\tВыход\t27.08.2019\t17:00\t7:01\n"
                  "\tВход\t28.08.2019\t07:38\tВыход\t28.08.2019\t17:03\t9:24\n"
                  "\tВсего\t95:22\n"
                  "\tвремени:\n"
                  "\n"
                  "\n"
                  "\n"
                  "\n"
                  "\tСтраница\t1\tиз\t1";
    return tStr;
}                          // returns test string
int main() {
    setlocale(LC_ALL, "RUS");

    string s = teststring();
//getline(cin, s);
//    cin >> s;
//pairPrint(basicStringTokenaser(s));
    /*splitForWord(s, "времени:").empty() ? cout << splitForWord(s, "времени:")[0] << splitForWord(s, "времени:").size()
                                         : cout << "NO";
*/
    cout << toTable(testperson());
    return 0;
}
